; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-7-50)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	package46 - package
	package47 - package
	package48 - package
	package49 - package
	package50 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	p0-2 - location
	p1-0 - location
	p1-2 - location
	p3-1 - location
	p3-2 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s3)
	(at driver4 s3)
	(at driver5 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s1)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s0)
	(empty truck5)
	(at truck6 s0)
	(empty truck6)
	(at truck7 s2)
	(empty truck7)
	(at package1 s3)
	(at package2 s1)
	(at package3 s1)
	(at package4 s3)
	(at package5 s0)
	(at package6 s3)
	(at package7 s1)
	(at package8 s2)
	(at package9 s3)
	(at package10 s1)
	(at package11 s1)
	(at package12 s0)
	(at package13 s1)
	(at package14 s2)
	(at package15 s2)
	(at package16 s2)
	(at package17 s1)
	(at package18 s3)
	(at package19 s0)
	(at package20 s3)
	(at package21 s2)
	(at package22 s1)
	(at package23 s1)
	(at package24 s1)
	(at package25 s3)
	(at package26 s3)
	(at package27 s3)
	(at package28 s0)
	(at package29 s3)
	(at package30 s0)
	(at package31 s2)
	(at package32 s0)
	(at package33 s3)
	(at package34 s1)
	(at package35 s2)
	(at package36 s1)
	(at package37 s2)
	(at package38 s2)
	(at package39 s0)
	(at package40 s3)
	(at package41 s2)
	(at package42 s1)
	(at package43 s1)
	(at package44 s1)
	(at package45 s3)
	(at package46 s3)
	(at package47 s2)
	(at package48 s2)
	(at package49 s0)
	(at package50 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s3 s2)
	(link s2 s3)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s3)
	(at driver3 s2)
	(at driver5 s0)
	(at truck2 s0)
	(at truck3 s2)
	(at truck4 s2)
	(at truck6 s1)
	(at package1 s3)
	(at package2 s2)
	(at package3 s2)
	(at package4 s3)
	(at package6 s3)
	(at package7 s1)
	(at package8 s2)
	(at package9 s2)
	(at package10 s0)
	(at package11 s3)
	(at package12 s1)
	(at package13 s3)
	(at package14 s2)
	(at package16 s1)
	(at package17 s2)
	(at package18 s1)
	(at package19 s1)
	(at package20 s2)
	(at package21 s0)
	(at package22 s1)
	(at package23 s3)
	(at package24 s2)
	(at package25 s1)
	(at package26 s3)
	(at package27 s1)
	(at package28 s0)
	(at package29 s1)
	(at package30 s1)
	(at package31 s0)
	(at package32 s1)
	(at package33 s2)
	(at package34 s3)
	(at package35 s3)
	(at package36 s2)
	(at package37 s2)
	(at package38 s2)
	(at package39 s1)
	(at package42 s1)
	(at package45 s0)
	(at package46 s2)
	(at package47 s0)
	(at package48 s3)
	(at package49 s3)
	(at package50 s2)
	))


)

; plan
1. (board-truck driver1 s0 truck1)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 14 of 52
2. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 14 of 52
3. (load-truck s1 package36 truck1)
   deleted: (at package36 s1)
   added: (in package36 truck1)
   goals met: 14 of 52
4. (load-truck s1 package34 truck1)
   deleted: (at package34 s1)
   added: (in package34 truck1)
   goals met: 14 of 52
5. (load-truck s1 package3 truck1)
   deleted: (at package3 s1)
   added: (in package3 truck1)
   goals met: 14 of 52
6. (load-truck s1 package24 truck1)
   deleted: (at package24 s1)
   added: (in package24 truck1)
   goals met: 14 of 52
7. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 14 of 52
8. (load-truck s2 package48 truck1)
   deleted: (at package48 s2)
   added: (in package48 truck1)
   goals met: 14 of 52
9. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 14 of 52
10. (load-truck s3 package9 truck1)
   deleted: (at package9 s3)
   added: (in package9 truck1)
   goals met: 14 of 52
11. (unload-truck s3 package48 truck1)
   deleted: (in package48 truck1)
   added: (at package48 s3)
   goals met: 15 of 52
12. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 15 of 52
13. (unload-truck s2 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 16 of 52
14. (load-truck s2 package47 truck1)
   deleted: (at package47 s2)
   added: (in package47 truck1)
   goals met: 16 of 52
15. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 16 of 52
16. (load-truck s1 package23 truck1)
   deleted: (at package23 s1)
   added: (in package23 truck1)
   goals met: 16 of 52
17. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 16 of 52
18. (load-truck s3 package46 truck1)
   deleted: (at package46 s3)
   added: (in package46 truck1)
   goals met: 16 of 52
19. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 16 of 52
20. (unload-truck s2 package46 truck1)
   deleted: (in package46 truck1)
   added: (at package46 s2)
   goals met: 17 of 52
21. (unload-truck s2 package36 truck1)
   deleted: (in package36 truck1)
   added: (at package36 s2)
   goals met: 18 of 52
22. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 18 of 52
23. (load-truck s1 package2 truck1)
   deleted: (at package2 s1)
   added: (in package2 truck1)
   goals met: 18 of 52
24. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 18 of 52
25. (load-truck s2 package35 truck1)
   deleted: (at package35 s2)
   added: (in package35 truck1)
   goals met: 18 of 52
26. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 18 of 52
27. (load-truck s3 package45 truck1)
   deleted: (at package45 s3)
   added: (in package45 truck1)
   goals met: 18 of 52
28. (unload-truck s3 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s3)
   goals met: 19 of 52
29. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 19 of 52
30. (load-truck s1 package17 truck1)
   deleted: (at package17 s1)
   added: (in package17 truck1)
   goals met: 19 of 52
31. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 19 of 52
32. (load-truck s2 package31 truck1)
   deleted: (at package31 s2)
   added: (in package31 truck1)
   goals met: 19 of 52
33. (unload-truck s2 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s2)
   goals met: 20 of 52
34. (unload-truck s2 package24 truck1)
   deleted: (in package24 truck1)
   added: (at package24 s2)
   goals met: 21 of 52
35. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 21 of 52
36. (load-truck s1 package13 truck1)
   deleted: (at package13 s1)
   added: (in package13 truck1)
   goals met: 21 of 52
37. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 21 of 52
38. (unload-truck s3 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s3)
   goals met: 22 of 52
39. (load-truck s3 package33 truck1)
   deleted: (at package33 s3)
   added: (in package33 truck1)
   goals met: 22 of 52
40. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 22 of 52
41. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 22 of 52
42. (unload-truck s2 package33 truck1)
   deleted: (in package33 truck1)
   added: (at package33 s2)
   goals met: 23 of 52
43. (load-truck s2 package21 truck1)
   deleted: (at package21 s2)
   added: (in package21 truck1)
   goals met: 23 of 52
44. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 23 of 52
45. (load-truck s0 package49 truck1)
   deleted: (at package49 s0)
   added: (in package49 truck1)
   goals met: 23 of 52
46. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 23 of 52
47. (load-truck s1 package11 truck1)
   deleted: (at package11 s1)
   added: (in package11 truck1)
   goals met: 23 of 52
48. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 23 of 52
49. (unload-truck s3 package49 truck1)
   deleted: (in package49 truck1)
   added: (at package49 s3)
   goals met: 24 of 52
50. (load-truck s3 package29 truck1)
   deleted: (at package29 s3)
   added: (in package29 truck1)
   goals met: 24 of 52
51. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 24 of 52
52. (unload-truck s1 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s1)
   goals met: 25 of 52
53. (load-truck s1 package10 truck1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 25 of 52
54. (drive-truck driver1 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 25 of 52
55. (unload-truck s0 package47 truck1)
   deleted: (in package47 truck1)
   added: (at package47 s0)
   goals met: 26 of 52
56. (unload-truck s0 package45 truck1)
   deleted: (in package45 truck1)
   added: (at package45 s0)
   goals met: 27 of 52
57. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 27 of 52
58. (unload-truck s2 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   goals met: 28 of 52
59. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 28 of 52
60. (load-truck s3 package27 truck1)
   deleted: (at package27 s3)
   added: (in package27 truck1)
   goals met: 28 of 52
61. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 28 of 52
62. (unload-truck s1 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s1)
   goals met: 29 of 52
63. (drive-truck driver1 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 29 of 52
64. (load-truck s0 package39 truck1)
   deleted: (at package39 s0)
   added: (in package39 truck1)
   goals met: 29 of 52
65. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 29 of 52
66. (unload-truck s1 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s1)
   goals met: 30 of 52
67. (load-truck s0 package32 truck5)
   deleted: (at package32 s0)
   added: (in package32 truck5)
   goals met: 30 of 52
68. (board-truck driver5 s0 truck5)
   deleted: (at driver5 s0) (empty truck5)
   added: (driving driver5 truck5)
   goals met: 29 of 52
69. (load-truck s0 package30 truck5)
   deleted: (at package30 s0)
   added: (in package30 truck5)
   goals met: 29 of 52
70. (load-truck s0 package19 truck5)
   deleted: (at package19 s0)
   added: (in package19 truck5)
   goals met: 29 of 52
71. (load-truck s0 package12 truck5)
   deleted: (at package12 s0)
   added: (in package12 truck5)
   goals met: 29 of 52
72. (drive-truck driver5 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 29 of 52
73. (drive-truck driver1 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 29 of 52
74. (unload-truck s0 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s0)
   goals met: 30 of 52
75. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 30 of 52
76. (drive-truck driver1 s2 s3 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s3)
   goals met: 30 of 52
77. (load-truck s3 package25 truck1)
   deleted: (at package25 s3)
   added: (in package25 truck1)
   goals met: 30 of 52
78. (unload-truck s3 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s3)
   goals met: 31 of 52
79. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 31 of 52
80. (unload-truck s2 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s2)
   goals met: 32 of 52
81. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 32 of 52
82. (unload-truck s0 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s0)
   goals met: 33 of 52
83. (unload-truck s0 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s0)
   goals met: 34 of 52
84. (drive-truck driver1 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 34 of 52
85. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 34 of 52
86. (load-truck s3 package20 truck1)
   deleted: (at package20 s3)
   added: (in package20 truck1)
   goals met: 34 of 52
87. (load-truck s3 package18 truck1)
   deleted: (at package18 s3)
   added: (in package18 truck1)
   goals met: 34 of 52
88. (drive-truck driver1 s3 s1 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   goals met: 34 of 52
89. (unload-truck s1 package25 truck1)
   deleted: (in package25 truck1)
   added: (at package25 s1)
   goals met: 35 of 52
90. (drive-truck driver1 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 35 of 52
91. (unload-truck s2 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s2)
   goals met: 36 of 52
92. (load-truck s2 package16 truck1)
   deleted: (at package16 s2)
   added: (in package16 truck1)
   goals met: 36 of 52
93. (drive-truck driver1 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 36 of 52
94. (unload-truck s1 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s1)
   goals met: 37 of 52
95. (unload-truck s1 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s1)
   goals met: 38 of 52
96. (drive-truck driver1 s1 s3 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s3)
   goals met: 38 of 52
97. (unload-truck s3 package13 truck1)
   deleted: (in package13 truck1)
   added: (at package13 s3)
   goals met: 39 of 52
98. (unload-truck s3 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s3)
   goals met: 40 of 52
99. (drive-truck driver1 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 40 of 52
100. (drive-truck driver1 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 40 of 52
101. (disembark-truck driver1 s0 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s0) (empty truck1)
   goals met: 41 of 52
102. (disembark-truck driver5 s1 truck5)
   deleted: (driving driver5 truck5)
   added: (at driver5 s1) (empty truck5)
   goals met: 41 of 52
103. (unload-truck s1 package32 truck5)
   deleted: (in package32 truck5)
   added: (at package32 s1)
   goals met: 42 of 52
104. (unload-truck s1 package30 truck5)
   deleted: (in package30 truck5)
   added: (at package30 s1)
   goals met: 43 of 52
105. (unload-truck s1 package19 truck5)
   deleted: (in package19 truck5)
   added: (at package19 s1)
   goals met: 44 of 52
106. (unload-truck s1 package12 truck5)
   deleted: (in package12 truck5)
   added: (at package12 s1)
   goals met: 45 of 52
107. (board-truck driver2 s2 truck2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 45 of 52
108. (walk driver3 s3 p3-2)
   deleted: (at driver3 s3)
   added: (at driver3 p3-2)
   goals met: 45 of 52
109. (walk driver3 p3-2 s2)
   deleted: (at driver3 p3-2)
   added: (at driver3 s2)
   goals met: 46 of 52
110. (board-truck driver5 s1 truck3)
   deleted: (at driver5 s1) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 46 of 52
111. (drive-truck driver5 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 46 of 52
112. (drive-truck driver2 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 46 of 52
113. (board-truck driver1 s0 truck6)
   deleted: (at driver1 s0) (empty truck6)
   added: (driving driver1 truck6)
   goals met: 45 of 52
114. (drive-truck driver1 s0 s1 truck6)
   deleted: (at truck6 s0)
   added: (at truck6 s1)
   goals met: 46 of 52
115. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 47 of 52
116. (disembark-truck driver1 s1 truck6)
   deleted: (driving driver1 truck6)
   added: (at driver1 s1) (empty truck6)
   goals met: 47 of 52
117. (drive-truck driver2 s0 s2 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s2)
   goals met: 46 of 52
118. (drive-truck driver2 s2 s3 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   goals met: 46 of 52
119. (disembark-truck driver2 s3 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 47 of 52
120. (board-truck driver4 s3 truck2)
   deleted: (at driver4 s3) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 47 of 52
121. (drive-truck driver4 s3 s2 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s2)
   goals met: 47 of 52
122. (drive-truck driver4 s2 s0 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s0)
   goals met: 48 of 52
123. (walk driver1 s1 p1-0)
   deleted: (at driver1 s1)
   added: (at driver1 p1-0)
   goals met: 48 of 52
124. (walk driver1 p1-0 s0)
   deleted: (at driver1 p1-0)
   added: (at driver1 s0)
   goals met: 49 of 52
125. (drive-truck driver5 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 49 of 52
126. (disembark-truck driver5 s1 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s1) (empty truck3)
   goals met: 49 of 52
127. (walk driver5 s1 p1-0)
   deleted: (at driver5 s1)
   added: (at driver5 p1-0)
   goals met: 49 of 52
128. (walk driver5 p1-0 s0)
   deleted: (at driver5 p1-0)
   added: (at driver5 s0)
   goals met: 50 of 52
129. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 49 of 52
130. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 49 of 52
131. (board-truck driver3 s1 truck3)
   deleted: (at driver3 s1) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 49 of 52
132. (drive-truck driver3 s1 s2 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s2)
   goals met: 50 of 52
133. (disembark-truck driver3 s2 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s2) (empty truck3)
   goals met: 51 of 52
134. (walk driver3 s2 p1-2)
   deleted: (at driver3 s2)
   added: (at driver3 p1-2)
   goals met: 50 of 52
135. (walk driver3 p1-2 s1)
   deleted: (at driver3 p1-2)
   added: (at driver3 s1)
   goals met: 50 of 52
136. (board-truck driver3 s1 truck4)
   deleted: (at driver3 s1) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 50 of 52
137. (drive-truck driver3 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 51 of 52
138. (disembark-truck driver3 s2 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s2) (empty truck4)
   goals met: 52 of 52
